app/models/repository.rb

  def self.update_trending_topics
    Repository.delete_all

    url = 'https://api.github.com/search/repositories?q=language:python&sort=stars&order=desc&per_page=10'
    request = RestClient.get(url)
    @get_github_python=JSON.parse(request.body).with_indifferent_access[:items]

    #getting ruby trendings
    url = 'https://api.github.com/search/repositories?q=language:ruby&sort=stars&order=desc&per_page=10'
    request = RestClient.get(url)
    @get_github_ruby=JSON.parse(request.body).with_indifferent_access[:items]

    #getting assembly trendings
    url = 'https://api.github.com/search/repositories?q=language:assembly&sort=stars&order=desc&per_page=10'
    request = RestClient.get(url)
    @get_github_assembly= JSON.parse(request.body).with_indifferent_access[:items]

    #getting java trendings
    url = 'https://api.github.com/search/repositories?q=language:java&sort=stars&order=desc&per_page=10'
    request = RestClient.get(url)
    @get_github_java=JSON.parse(request.body).with_indifferent_access[:items]

    #getting php trendings
    url = 'https://api.github.com/search/repositories?q=language:php&sort=stars&order=desc&per_page=10'
    request = RestClient.get(url)
    @get_github_php= JSON.parse(request.body).with_indifferent_access[:items]

    @get_github_ruby.each do |subhash|
      repository = Repository.create(
        external_id: subhash[:id],
        name: subhash[:name],
        language: subhash[:language],
        owner_name: subhash[:owner][:login]
       )
    end

    @get_github_php.each do |subhash|
      repository = Repository.create(
        external_id: subhash[:id],
        name: subhash[:name],
        language: subhash[:language],
        owner_name: subhash[:owner][:login]
      )
    end

    @get_github_java.each do |subhash|
      repository = Repository.create(
        external_id: subhash[:id],
        name: subhash[:name],
        language: subhash[:language],
        owner_name: subhash[:owner][:login]
      )
    end

    @get_github_python.each do |subhash|
      repository = Repository.create(
        external_id: subhash[:id],
        name: subhash[:name],
        language: subhash[:language],
        owner_name: subhash[:owner][:login]
      )
    end

    @get_github_assembly.each do |subhash|
      repository = Repository.create(
        external_id: subhash[:id],
        name: subhash[:name],
        language: subhash[:language],
        owner_name: subhash[:owner][:login]
      )
---
DELETE FROM "repositories"
INSERT INTO "repositories" ("external_id", "name", "owner_name", "created_at", "updated_at", "language") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["external_id", 8514], ["name", "rails"], ["owner_name", "rails"], ["created_at", "2019-11-10 19:13:51.608588"], ["updated_at", "2019-11-10 19:13:51.608588"], ["language", "Ruby"]]
INSERT INTO "repositories" ("external_id", "name", "owner_name", "created_at", "updated_at", "language") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["external_id", 1863329], ["name", "laravel"], ["owner_name", "laravel"], ["created_at", "2019-11-10 19:13:52.465974"], ["updated_at", "2019-11-10 19:13:52.465974"], ["language", "PHP"]]
INSERT INTO "repositories" ("external_id", "name", "owner_name", "created_at", "updated_at", "language") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["external_id", 121395510], ["name", "CS-Notes"], ["owner_name", "CyC2018"], ["created_at", "2019-11-10 19:13:52.985393"], ["updated_at", "2019-11-10 19:13:52.985393"], ["language", "Java"]]
INSERT INTO "repositories" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-10 18:28:20.496337"], ["updated_at", "2019-11-10 18:28:20.496337"]]
INSERT INTO "repositories" ("external_id", "name", "owner_name", "created_at", "updated_at", "language") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"